---
#**************************************
lang: en-AU
layout: post
social-share: true
category: kb

typora-copy-images-to: ../assets/img/${filename}
typora-root-url: ../
#**************************************

#*************************************
#fill this if you have renamed the page
redirect_from:
#*************************************

title: KB0004
subtitle: Verify the Tier-0 Logical Router and TOR Connection
author: stephen
updated:
cover-img: /assets/logos/nsx.png
thumbnail-img: /assets/logos/nsx-icon.png
full-width: false

share-title:
share-description: 
share-img: /assets/logos/nsx-icon.png

tags:
  - vmware
  - nsx
  - tier-0
  - tor switch
  - switch
categories: kb
comments: true
---

For routing to work on the uplink from the tier-0 router, connectivity with the top-of-rack device must be in place.

## Prerequisites

Verify that the tier-0 logical router is connected to a VLAN logical switch. See Connect a Tier-0 Logical Router to a VLAN Logical Switch for the NSX Edge Uplink in Manager Mode.

## Procedure

1. Log in to the NSX Edge CLI.
2. On the NSX Edge, run the get logical-routers command to find the VRF number of the tier-0 service router.

```terminal
 nsx-edge-1> get logical-routers
Logical Router
UUID        : 736a80e3-23f6-5a2d-81d6-bbefb2786666
vrf         : 0
type        : TUNNEL

Logical Router
UUID        : 421a2d0d-f423-46f1-93a1-2f9e366176c8
vrf         : 5
type        : SERVICE_ROUTER_TIER0

Logical Router
UUID        : f3ce9d7d-7123-47d6-aba6-45cf1388ca7b
vrf         : 6
type        : DISTRIBUTED_ROUTER

Logical Router
UUID        : c8e64eff-02b2-4462-94ff-89f3788f1a61
vrf         : 7
type        : SERVICE_ROUTER_TIER1

Logical Router
UUID        : fb6c3f1f-599f-4421-af8a-99692dff3dd4
vrf         : 8
type        : DISTRIBUTED_ROUTER
```

3. Run the vrf <number> command to enter the tier-0 service router context.

``` terminal
nsx-edge-1> vrf 5
nsx-edge1(tier0_sr)> 
```

4. On the tier-0 service router, run the get route command and make sure the expected route appears in the routing table.
   Notice that the route to the TOR appears as connected (c).

```terminal
nsx-edge1(tier0_sr)> get route
Flags: t0c - Tier0-Connected, t0s - Tier0-Static, b - BGP,
t0n - Tier0-NAT, t1s - Tier1-Static, t1c - Tier1-Connected,
t1n: Tier1-NAT, t1l: Tier1-LB VIP, t1ls: Tier1-LB SNAT,
t1d: Tier1-DNS FORWARDER, t1ipsec: Tier1-IPSec, isr: Inter-SR,
> - selected route, * - FIB route

Total number of routes: 11

t1c> * 1.1.1.0/25 [3/0] via 100.64.1.1, downlink-282, 08w4d03h
t1c> * 1.1.2.0/24 [3/0] via 100.64.1.1, downlink-282, 08w4d03h
t0c> * 1.1.3.0/24 is directly connected, downlink-275, 08w4d03h
b  > * 2.1.4.0/24 [20/0] via 40.40.40.10, uplink-273, 01w0d02h
b  > * 10.182.48.0/20 [20/0] via 40.40.40.10, uplink-273, 01w0d02h
t0c> * 40.40.40.0/24 is directly connected, uplink-273, 08w4d03h
t0c> * 100.64.1.0/31 is directly connected, downlink-282, 08w4d03h
t0c> * 169.254.0.0/24 is directly connected, downlink-277, 01w0d02h
b  > * 172.17.0.0/16 [20/0] via 40.40.40.10, uplink-273, 01w0d02h
t0c> * fc36:a750:db0d:7800::/64 is directly connected, downlink-282, 08w4d03h
t0c> * fe80::/64 is directly connected, downlink-282, 08w4d03h
Ping the TOR.
 nsx-edge1(tier0_sr)> ping	192.168.100.254
PING 192.168.100.254 (192.168.100.254): 56 data bytes
64 bytes from 192.168.100.254: icmp_seq=0 ttl=64 time=2.822 ms
64 bytes from 192.168.100.254: icmp_seq=1 ttl=64 time=1.393 ms
^C
nsx-edge1>
--- 192.168.100.254 ping statistics ---
3 packets transmitted, 2 packets received, 33.3% packet loss
round-trip min/avg/max/stddev = 1.393/2.107/2.822/0.715 ms
```

## Results

Packets are sent between the tier-0 logical and physical router to verify a connection.

## Further Reading

1. [Configure BGP on a Tier-0 Logical Router in Manager Mode](https://docs.vmware.com/en/VMware-NSX-T-Data-Center/3.1/administration/GUID-4BC07C6A-DC62-496B-A6A9-7219ACF5AC7B.html)
